﻿﻿//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2013, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
//**********************************************************************
//<AMI_FHDR_START>
//
// Name:  <W83627DHGHwmSetup.uni>
//
// Description: SIO Form String Definitions
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"
//If customer define the common logical device by themselves, add here.
#string STR_W83627DHG_POWER_LOSS_CONFIG               #language eng "AC Power Loss State"
#string STR_W83627DHG_POWER_LOSS_CONFIG_HELP          #language eng "Set the state after power loss."
#string STR_POWER_OFF                                 #language eng "Always OFF"
#string STR_POWER_ON                                  #language eng "Always ON"
#string STR_LAST_STATE                                #language eng "Last State"

//
// HardWare Monitor 
//
#string STR_W83627DHG_HMM_CONFIGURATION               #language eng "W83627DHG HW Monitor"
#string STR_W83627DHG_HMM_CONFIGURATION_HELP          #language eng "Monitor hardware status"
#string STR_PC_HEALTH                                   #language eng "Pc Health Status"

#string STR_W83627DHG_HWM1_CPU_DTS_TEMP               #language eng "CPU Temperature (DTS)"
#string STR_W83627DHG_HWM1_CPU_DTS_TEMP_VALUE         #language eng "N/A"

#string STR_W83627DHG_HWM1_VIN0                       #language eng "VIN0"
#string STR_W83627DHG_HWM1_VIN0_VALUE                 #language eng "N/A"
#string STR_W83627DHG_HWM1_VCORE                      #language eng "VCORE"
#string STR_W83627DHG_HWM1_VCORE_VALUE                #language eng "N/A"
#string STR_W83627DHG_HWM1_VACC                       #language eng "VACC"
#string STR_W83627DHG_HWM1_VACC_VALUE                 #language eng "N/A"

//SmartFan Settings
#string STR_W83627DHG_SMARTFAN_PROMPT                             #language eng "Smart Fan Function"
#string STR_W83627DHG_SMARTFAN_PROMPT_HELP                        #language eng "Enable or Disable Smart Fan"
#string STR_W83627DHG_SMARTFAN_FORM                               #language eng "Smart Fan Mode Configuration"
#string STR_W83627DHG_SMARTFAN_FORM_HELP                          #language eng "Smart Fan Mode Select"

#string STR_W83627DHG_SMARTFAN1_CONFIG                            #language eng "SYS Smart Fan Mode"
#string STR_W83627DHG_SMARTFAN1_CONFIG_HELP                       #language eng "SYS Smart Fan Mode Select"
#string STR_W83627DHG_SMARTFAN1_MODE0                             #language eng "Manual Mode"
#string STR_W83627DHG_SMARTFAN1_MODE1                             #language eng "Thermal Cruise Mode"
#string STR_W83627DHG_SMARTFAN1_MODE2                             #language eng "Fan Speed Cruise Mode"
#string STR_W83627DHG_FAN1_MANUAL_FANOUT_VALUE                    #language eng "SYSFAN expect PWM Output/DC Voltage Output"
#string STR_W83627DHG_FAN1_MANUAL_FANOUT_VALUE_HELP               #language eng "Input expect PWM Output Value(Range:0 - 255)"
#string STR_W83627DHG_FAN1_TARGET_TEMP_VALUE                      #language eng "SYSFAN Target Temperature"
#string STR_W83627DHG_FAN1_TARGET_TEMP_VALUE_HELP                 #language eng "Input SYSFAN Target Temperatur (Range:0 - 127)"
#string STR_W83627DHG_FAN1_TEMP_TOLERANCE_VALUE                   #language eng "SYSFAN Tolerance of Target Temperature"
#string STR_W83627DHG_FAN1_TEMP_TOLERANCE_VALUE_HELP              #language eng "Input Tolerance of Target Temperature (Range:0 - 15)"
#string STR_W83627DHG_FAN1_TARGET_SPEED_VALUE                     #language eng "SYSFAN Target Speed Count"
#string STR_W83627DHG_FAN1_TARGET_SPEED_VALUE_HELP                #language eng "Input Target Speed Count (Range:0 - 255)"
#string STR_W83627DHG_FAN1_SPEED_TOLERANCE_VALUE                  #language eng "SYSFAN Tolerance of Target Speed Count"
#string STR_W83627DHG_FAN1_SPEED_TOLERANCE_VALUE_HELP             #language eng "Input Tolerance of Target Speed Count (Range:0 - 15)"

#string STR_W83627DHG_SMARTFAN2_CONFIG                            #language eng "CPU Smart Fan 0 Mode"
#string STR_W83627DHG_SMARTFAN2_CONFIG_HELP                       #language eng "CPU Smart Fan 0 Mode Select"
#string STR_W83627DHG_SMARTFAN2_MODE0                             #language eng "Manual Mode"
#string STR_W83627DHG_SMARTFAN2_MODE1                             #language eng "Thermal Cruise Mode"
#string STR_W83627DHG_SMARTFAN2_MODE2                             #language eng "Fan Speed Cruise Mode"
#string STR_W83627DHG_SMARTFAN2_MODE3                             #language eng "SMART FAN III Mode"
#string STR_W83627DHG_FAN2_MANUAL_FANOUT_VALUE                    #language eng "CPUFAN0 expect PWM Output/DC Voltage Output"
#string STR_W83627DHG_FAN2_MANUAL_FANOUT_VALUE_HELP               #language eng "Input expect PWM Output Value(Range:0 - 255)"
#string STR_W83627DHG_FAN2_TARGET_TEMP_VALUE                      #language eng "CPUFAN0 Target Temperature"
#string STR_W83627DHG_FAN2_TARGET_TEMP_VALUE_HELP                 #language eng "Input CPUFAN0 Target Temperatur (Range:0 - 127)"
#string STR_W83627DHG_FAN2_TEMP_TOLERANCE_VALUE                   #language eng "CPUFAN0 Tolerance of Target Temperature"
#string STR_W83627DHG_FAN2_TEMP_TOLERANCE_VALUE_HELP              #language eng "Input Tolerance of Target Temperature (Range:0 - 15)"
#string STR_W83627DHG_FAN2_TARGET_SPEED_VALUE                     #language eng "CPUFAN0 Target Speed Count"
#string STR_W83627DHG_FAN2_TARGET_SPEED_VALUE_HELP                #language eng "Input Target Speed Count (Range:0 - 255)"
#string STR_W83627DHG_FAN2_SPEED_TOLERANCE_VALUE                  #language eng "CPUFAN0 Tolerance of Target Speed Count"
#string STR_W83627DHG_FAN2_SPEED_TOLERANCE_VALUE_HELP             #language eng "Input Tolerance of Target Speed Count (Range:0 - 15)"

#string STR_W83627DHG_SMARTFAN3_CONFIG                            #language eng "AUX Smart Fan Mode"
#string STR_W83627DHG_SMARTFAN3_CONFIG_HELP                       #language eng "AUX Smart Fan Mode Select"
#string STR_W83627DHG_SMARTFAN3_MODE0                             #language eng "Manual Mode"
#string STR_W83627DHG_SMARTFAN3_MODE1                             #language eng "Thermal Cruise Mode"
#string STR_W83627DHG_SMARTFAN3_MODE2                             #language eng "Fan Speed Cruise Mode"
#string STR_W83627DHG_FAN3_MANUAL_FANOUT_VALUE                    #language eng "AUXFAN expect PWM Output/DC Voltage Output"
#string STR_W83627DHG_FAN3_MANUAL_FANOUT_VALUE_HELP               #language eng "Input expect PWM Output Value(Range:0 - 255)"
#string STR_W83627DHG_FAN3_TARGET_TEMP_VALUE                      #language eng "AUXFAN Target Temperature"
#string STR_W83627DHG_FAN3_TARGET_TEMP_VALUE_HELP                 #language eng "Input AUXFAN Target Temperatur (Range:0 - 127)"
#string STR_W83627DHG_FAN3_TEMP_TOLERANCE_VALUE                   #language eng "AUXFAN Tolerance of Target Temperature"
#string STR_W83627DHG_FAN3_TEMP_TOLERANCE_VALUE_HELP              #language eng "Input Tolerance of Target Temperature (Range:0 - 15)"
#string STR_W83627DHG_FAN3_TARGET_SPEED_VALUE                     #language eng "AUXFAN Target Speed Count"
#string STR_W83627DHG_FAN3_TARGET_SPEED_VALUE_HELP                #language eng "Input Target Speed Count (Range:0 - 255)"
#string STR_W83627DHG_FAN3_SPEED_TOLERANCE_VALUE                  #language eng "AUXFAN Tolerance of Target Speed Count"
#string STR_W83627DHG_FAN3_SPEED_TOLERANCE_VALUE_HELP             #language eng "Input Tolerance of Target Speed Count (Range:0 - 15)"

#string STR_W83627DHG_SMARTFAN4_CONFIG                            #language eng "CPU Smart Fan 1 Mode"
#string STR_W83627DHG_SMARTFAN4_CONFIG_HELP                       #language eng "CPU Smart Fan 1 Mode Select"
#string STR_W83627DHG_SMARTFAN4_MODE0                             #language eng "Manual Mode"
#string STR_W83627DHG_SMARTFAN4_MODE1                             #language eng "Thermal Cruise Mode"
#string STR_W83627DHG_SMARTFAN4_MODE2                             #language eng "Fan Speed Cruise Mode"
#string STR_W83627DHG_SMARTFAN4_MODE3                             #language eng "SMART FAN III Mode"
#string STR_W83627DHG_FAN4_MANUAL_FANOUT_VALUE                    #language eng "CPUFAN1 expect PWM Output/DC Voltage Output"
#string STR_W83627DHG_FAN4_MANUAL_FANOUT_VALUE_HELP               #language eng "Input expect PWM Output Value(Range:0 - 255)"
#string STR_W83627DHG_FAN4_TARGET_TEMP_VALUE                      #language eng "CPUFAN1 Target Temperature"
#string STR_W83627DHG_FAN4_TARGET_TEMP_VALUE_HELP                 #language eng "Input CPUFAN1 Target Temperatur (Range:0 - 127)"
#string STR_W83627DHG_FAN4_TEMP_TOLERANCE_VALUE                   #language eng "CPUFAN1 Tolerance of Target Temperature"
#string STR_W83627DHG_FAN4_TEMP_TOLERANCE_VALUE_HELP              #language eng "Input Tolerance of Target Temperature (Range:0 - 15)"
#string STR_W83627DHG_FAN4_TARGET_SPEED_VALUE                     #language eng "CPUFAN1 Target Speed Count"
#string STR_W83627DHG_FAN4_TARGET_SPEED_VALUE_HELP                #language eng "Input Target Speed Count (Range:0 - 255)"
#string STR_W83627DHG_FAN4_SPEED_TOLERANCE_VALUE                  #language eng "CPUFAN1 Tolerance of Target Speed Count"
#string STR_W83627DHG_FAN4_SPEED_TOLERANCE_VALUE_HELP             #language eng "Input Tolerance of Target Speed Count (Range:0 - 15)"

    
//#string <string name>                   #language eng ""
//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2013, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************